Weblog Mini Assignment/weblog/app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(page: params[:page],
                         per_page: params[:per_page])
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)
	@post.user = User.find_by email: params[:email]

    respond_to do |format|
      if @post.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jam93@aber.ac.uk"], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "created_at", "updated_at", "body", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "dfsf"], ["created_at", "2017-10-26 18:59:20.329394"], ["updated_at", "2017-10-26 18:59:20.329394"], ["body", "sdfsdfsd"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Test title c1111111"], ["body", "this ia an egfrsgfsdgsdgsdgsxample test"], ["updated_at", "2017-10-27 16:47:36.530033"], ["id", 10]]