Weblog Mini Assignment/weblog/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY surname, firstname LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page],
                           per_page: params[:per_page])
                 .order('surname, firstname')

INSERT INTO "users" ("surname", "firstname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["surname", "McDonagh"], ["firstname", "Jake"], ["email", "jam93@aber.ac.uk"], ["created_at", "2017-10-26 18:57:54.051893"], ["updated_at", "2017-10-26 18:57:54.051893"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "surname" = ?, "firstname" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["surname", "Andrew"], ["firstname", "The Andrew"], ["email", "theand@and.and"], ["updated_at", "2017-10-26 19:15:17.368850"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)